#+BEGIN_COMMENT
.. title: Ein - Ipython Notebooks in Emacs
.. slug: ein-ipython-notebooks-in-emacs
.. date: 2020-06-21 21:15:24 UTC+02:00
.. tags: emacs
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT


I recently decided to switch from using =ob-ipython= to =ein= for
working with the ipython kernel on Emacs. I was quite satisfied with
the first but I noticed it was not maintained anymore, while there
seems to be quite a lot of activity around =ein=. I therefore decided
to stay up to date in order to benefit from the development in the
second package.

This post summarizes the major things that makes it possible and the
key workflow to operate through =EIN= properly.

{{{TEASER_END}}}


** Add kernel to jupyter

To check which kernel are installed on your jupyter notebook server
you can run

#+BEGIN_SRC sh
jupyter kernelspec list
#+END_SRC

#+RESULTS:
| Available  | kernels:                                              |
| treeschutz | /Users/marcohassan/Library/Jupyter/kernels/treeschutz |
| python3    | /usr/local/share/jupyter/kernels/python3              |

It is then possible to add a virtualenvironment in the following way

#+BEGIN_SRC sh
# activate virtualenvironment
source ~/Desktop/python_venv/spark/bin/activate

# download jupyter
pip3 install jupyter

# Add the virtualenvironment kernel
<virtual_env>/bin/ipython kernel install --name "spark" --user
#+END_SRC

#+BEGIN_SRC sh
jupyter kernelspec list
#+END_SRC

#+RESULTS:
| Available  | kernels:                                              |
| spark      | /Users/marcohassan/Library/Jupyter/kernels/spark      |
| treeschutz | /Users/marcohassan/Library/Jupyter/kernels/treeschutz |
| python3    | /usr/local/share/jupyter/kernels/python3              |

To remove a specific kernel you can then use

#+BEGIN_SRC sh
jupyter kernelspec uninstall <unwanted_kernel>
#+END_SRC

Notice that the kernelspec list must be of the type above with
=/usr/local/share/jupyter/kernels/python3= as path. Otherwise
something breaks and the virtualenvironment is not active for the
kernel.

